Revit 2024 API
Application.VersionName Property
 Returns the name of the Revit application.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string VersionName { get; }
Visual Basic
Public ReadOnly Property VersionName As String
	Get
Visual C++
public:
property String^ VersionName {
	String^ get ();
}
Remarks
 This property can be used by your application to find the version of Revit against which your application is running. Based on this information your application can report if it is able to work correctly with that version of Revit.
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace